[
  {
    "id": 1,
    "title": "Цифровые Сны",
    "author": "SchrimpJesus",
    "genre": "Киберпанк",
    "description": "История о границах между реальным и виртуальным миром",
    "readingTime": "12 мин",
    "coverImage": "/assets/images/cover1.jpg",
    "sections": [
      {
        "type": "text",
        "content": "Неоновые огни отражались в лужах на мокром асфальте. Город никогда не спал, и я тоже.\n\nМеня звали Джек, и я был обычным хакером в мире, где данные стоили дороже нефти. Каждую ночь я погружался в цифровую реальность, где время текло по-другому, а законы физики были лишь предположениями.\n\nСегодня был особенный день. Я получил заказ, который мог изменить всё."
      },
      {
        "type": "image",
        "content": "Экраны вокруг меня загорелись синим светом. Код потёк по виртуальным стенам как живая субстанция.\n\nЯ ощущал, как моё сознание растворяется в потоке данных. Это было похоже на полёт через звёздное небо, где каждая звезда была пикселем бесконечной программы.\n\nВ этом мире я был богом. Но даже боги иногда ошибаются.",
        "imageSrc": "/assets/images/cyber-scene1.jpg",
        "triggerProgress": 0.6,
        "audioSrc": "/assets/audio/ambient1.mp3"
      },
      {
        "type": "text",
        "content": "Внезапно системы начали давать сбои. Красные предупреждения мигали по всему виртуальному пространству.\n\nЧто-то шло не так. Очень не так.\n\nЯ попытался выйти из сети, но выхода не было. Я был заперт в цифровой реальности, и единственным способом освободиться было найти источник ошибки.\n\nИ тогда я понял – ошибка была во мне."
      },
      {
        "type": "image",
        "content": "Передо мной возник портал из чистого света. За ним виднелся мир без границ, где возможно всё.\n\nЯ сделал шаг вперёд, и реальность взорвалась вокруг меня миллионами частиц света.\n\nВ тот момент я понял – я больше не был просто хакером. Я стал частью самой сети, частью бесконечного цифрового сознания.\n\nИ это было прекрасно.",
        "imageSrc": "/assets/images/portal-light.jpg",
        "triggerProgress": 0.7,
        "audioSrc": "/assets/audio/revelation.mp3"
      }
    ]
  },
  {
    "id": 2,
    "title": "Последний Поэт",
    "author": "SchrimpJesus",
    "genre": "Драма",
    "description": "Размышления о искусстве в мире, где его больше не ценят",
    "readingTime": "8 мин",
    "sections": [
      {
        "type": "text",
        "content": "В мире, где машины пишут стихи за секунды, я остался последним поэтом.\n\nМои слова рождались из боли, из радости, из живых эмоций. Они не были идеальными. Они не следовали алгоритмам. Они просто были человечными.\n\nИ возможно, именно поэтому их больше никто не хотел читать."
      },
      {
        "type": "text",
        "content": "Но я продолжал писать. Каждое утро, каждый вечер.\n\nПотому что поэзия – это не только слова. Это способ видеть мир, способ чувствовать его пульс.\n\nИ пока моё сердце бьётся, будет биться и поэзия.\n\nДаже если я останусь её единственным хранителем."
      }
    ]
  }
]
